// pages/rules.js
import FooterMobile from "@components/Navbars/AppNav/FooterMobile";
import Navbar from "@components/Navbars/AppNav/kraboHeader";
import MainLayout from "@layouts/Main";
import fs from 'fs';


const rulesList = [
    {
      mainTitle: "حریم خصوصی:",
      text: 'سایت ما اطلاعاتی چون نام، شماره تلفن همراه، ایمیل، آدرس و ... را برای ارایه خدمات و اطلاع رسانی به کاربران جمع آوری می‌کند و حفظ امنیت این اطلاعات شخصی و محتویات حساب کاربری افراد را در حد توان به عهده دارد. از طرفی کاربران مسئولیت تمام فعالیت‌هایی که با حساب کاربری خود انجام می‌دهند را بر عهده دارند و باید مراقب رمز عبور خود باشند.',
    },
    {
      mainTitle: "ورود به سایت:",
      text: 'با وارد کردن شماره همراه در لینک ثبت نام، یک کد برای شما پیامک می‌شود که رمز عبور شماست. با آن کد می‌توانید وارد شده و از سایت خرید کنید. اگر اطلاعات دیگر خود مانند نام، آدرس ایمیل، تاریخ تولد و ... را در بخش حساب کاربری وارد نمایید تعامل بهتری بین ما و شما ایجاد شده و ما می‌توانیم شما را از اخبار مهم، محصولات جدید، پیشنهادات ویژه و سایر موارد آگاه کنیم.',
    },
    {
      mainTitle: "محصول فوری و محصول سفارشی:",
      text: 'برای پیدا کردن محصول مورد نظر خود می‌توانید در منوها جستجو کرده و یا از فیلترهای جستجو کمک بگیرید. بعد از انتخاب محصول دلخواه خود حتما به تاریخ تحویل دقت کنید. بعضی از کالاها در انبار موجود بوده و لیبل سبز "موجود در انبار" دارند. قیمت و وزن این محصولات به طور دقیق مشخص می‌باشد و پس از ثبت سفارش، ارسال با توجه به بازه زمانی انتخابی مشتری انجام می‌شود.',
    },
    {
      text: 'کالاهایی که موجود نیست با لیبل آبی "سفارش ساخت" مشخص شده‌اند. این محصولات در انبار موجود نبوده و باید ساخته شوند، لذا 7 الی 10 روز کاری (به استثنای برخی محصولات که زمان ساخت 15 الی 20 روز کاری یا 20 الی 30 روز کاری دارند) زمان می‌برد تا پروسه ساخت محصولات انجام شده و آماده ارسال شوند.',
    },
    {
      text: 'در صورت ثبت سفارش از محصول سفارشی ابتدا مبلغ بیعانه معادل 80 درصد مبلغ کل توسط کاربر پرداخت می‌گردد و سفارش به کارگاه ارسال می‌شود. پس از تکمیل ساخت و مشخص شدن وزن دقیق محصول، قیمت نهایی بر اساس قیمت طلا در لحظه ثبت سفارش محاسبه می‌شود و فاکتور نهایی صادر می‌گردد. در این هنگام از طریق پیامک به کاربر اطلاع داده می‌شود تا نسبت به پرداخت مابقی مبلغ اقدام کند. بعد از تسویه مابقی مبلغ توسط کاربر جدول زمانی تحویل کالا برای کاربر نشان داده می‌شود تا بتواند زمان دریافت بسته را انتخاب کند.',
    },
    {
      text: 'در صورت کنسل کردن سفارش ساخت بعد از اینکه در حالت ساخت قرار می‌گیرد، نصف یا همه اجرت کسر می‌شود. در مواردی که محصول با آیتم‌های اختصاصی‌سازی شده برای یک کاربر ساخته می‌شود طبیعتا کنسل کردن بعد از ساخت، کل اجرت را کسر می‌کند.',
    },
    {
      text: 'برای محصولات سفارشی، قیمت و وزن درج شده در سایت حدودی بوده و بعد از ساخت امکان تغییر وزن وجود دارد. بدیهی است که در ساخت طلا هیچ دو محصولی با یک طرح نمی‌توانند هم وزن باشند، از این رو ممکن است بعد از ساخت وزن محصول بیشتر و یا کمتر شود. در محصولاتی مانند انگشترها، دستبندها، پابندها و زنجیرهای سنگین که امکان انتخاب سایز برای آنها موجود است، تغییر سایز می‌تواند در وزن طلا بین 1 تا 4 گرم نوسان داشته باشد.',
    },
    {
      mainTitle: "آدرس تحویل:",
      text: 'لطفا دقت بفرمایید که آدرس، موقعیت مکانی، شماره تلفن و نام شخص گیرنده را درست وارد کنید. بدیهی است اگر اطلاعات وارد شده اشتباه باشد، سفارش به مقصد نرسیده یا لااقل به موقع نمی‌رسد.',
    },
    {
      text: 'در صورت عدم حضور تحویل گیرنده در محل و یا عدم انتخاب دقیق موقعیت مکانی، هزینه ارسال مجدد به عهده مشتری می‌باشد.',
    },
    {
      text: 'ارسال‌های تهران با توجه به موقعیت مکانی و گزینه انتخابی (ارسال عادی، درب محل و یا اکسپرس)، توسط پیک امین گالری کرابو یا پیک موتوری صورت می‌گیرد.',
    },
    {
      text: 'ارسال‌های شهرستان توسط اداره پست صورت می‌گیرد.',
    },
    {
      text: 'لازم به ذکر است تحویل سفارش در اماکن عمومی امکان‌پذیر نبوده و آدرس تحویل باید دقیق و قابل استناد باشد.',
    },
    {
      mainTitle: "ارسال برای شهرستان‌ها:",
      text: 'سفارشاتی که محصول موجود باشد، پس از تسویه کامل و انجام احراز هویت توسط تیم گالری طلا کرابو، 1 روز کاری بعد از طریق اداره پست ارسال می‌گردند. با توجه به منطقه ارسالی، پست بسته‌ها به صورت ویژه یا پیشتاز انجام می‌شود. لازم به ذکر است که اداره پست از ابتدای سال 1400 بسته‌های طلا را بیمه نمی‌کند و در صورتی که بسته به دست مشتری نرسد فقط تا سقف 2 میلیون تومان بیمه می‌شود.',
    },
    {
      mainTitle: "نحوه ارسال:",
      text: 'ارسال‌های تهران با توجه به موقعیت مکانی و گزینه انتخابی مشتری جهت دریافت بسته، توسط پیک امین گالری طلا کرابو یا پیک موتوری صورت می‌گیرد.',
    },
    {
      text: 'ارسال برای شهرستان توسط پست انجام می‌شود.',
    },
    {
      mainTitle: "بازگرداندن و تعویض:",
      text: 'تمامی محصولات موجود (به‌جز محصولات سفارشی ساخت) به صورت آنلاین از گالری طلا کرابو خریداری می‌کنید، تا 3 روز ضمانت بازگشت و تا 7 روز ضمانت تعویض دارند.',
    },
    {
      text: 'برای هر سفارش فقط یک‌بار امکان تعویض وجود دارد.',
    },
    {
      text: 'قبل از ارسال بسته‌ها، تمامی محصولات در چندین مرحله توسط کارشناسان گالری طلا کرابو بررسی شده و در سلامت کامل بسته‌بندی و ارسال می‌گردند.',
    },
    {
      text: 'آسیب‌های ناشی از حمل و نقل باید در عرض 24 ساعت کاری پس از تحویل سفارش به پشتیبانی آنلاین گالری طلا کرابو اطلاع داده شده و کالای آسیب‌دیده به همراه کلیه متعلقات و فاکتور به دفتر مرکزی گالری طلا کرابو تحویل داده شده یا پست گردد.',
    },
    {
      text: 'در هنگام دریافت بسته از پیک دقت بفرمایید که کالا و بسته‌بندی در سلامت کامل باشد و در صورت مشاهده هرگونه ایراد بلافاصله با پشتیبانی آنلاین تماس گرفته و مورد را در میان بگذارید. بعد از هماهنگی با پشتیبانی، مراتب به شما اعلام می‌شود.',
    },
    {
      text: 'برای بازگرداندن یا تعویض کالا، قبل از هر اقدامی با پشتیبانی سایت (09031787789) هماهنگ بفرمایید. بعد از هماهنگی با پشتیبان فروش آنلاین، کالای مرجوعی را به آدرس دفتر مرکزی پست بفرمایید.',
    },
    {
      text: 'در صورت پس دادن محصول به علت نپسندیدن کالا، مبلغ پرداختی طی 48 الی 72 ساعت کاری بعد از بازگشت محصول با کسر هزینه ارسال و بسته‌بندی به حساب مشتری باز می‌گردد. در صورت وارد کردن آسیب به کالا هزینه خسارت وارده نیز کسر می‌گردد.',
    },
    {
      text: 'در صورت پس دادن کالا به علت وجود ایراد فنی، بعد از تصویب کارشناسان گالری طلا کرابو، کل هزینه طی 48 الی 72 ساعت کاری به حساب مشتری برگردانده می‌شود.',
    },
    {
      text: 'در صورت کنسل کردن سفارش ساخت بعد از اینکه در حالت ساخت قرار می‌گیرد، نصف یا همه اجرت کسر می‌شود. در مواردی که محصول با آیتم‌های اختصاصی‌سازی شده برای یک کاربر ساخته می‌شود طبیعتا کنسل کردن بعد از ساخت، کل اجرت را کسر می‌کند.',
    },
  ];
  

export default function Rules({header}) {
  return (
    <>
      <MainLayout isRTL>
        <Navbar />
        <div style={styles.container}>
          <h1 style={styles.title}>قوانین و مقررات</h1>
          <h2 style={styles.title2}> بسمه تعالی </h2>
          <p className="mb-10">
            گروه کرابو ضمن قدردانی از اعتماد شما، قوانین و مقررات استفاده از سایت را در این صفحه منتشر کرده و اگر تغییراتی در آن ایجاد شود همینجا به روزرسانی خواهد کرد. بنابراین بر عهده کاربران عزیز است که پیش از استفاده از سایت این صفحه را مطالعه بفرمایند.
          </p>
          <ul style={styles.rulesList}>
            {rulesList.map((rule, index) => (
              <li key={index} style={styles.ruleItem}>
                <h3 style={styles.ruleTitle}>{rule.mainTitle}</h3>
                <p>{rule.text}</p>
              </li>
            ))}
          </ul>
        </div>
        <div style={{ height: 80 }}></div>
      </MainLayout>
    <FooterMobile location="home" header={header?.data?.data}/>

    </>
  );
}

const styles = {
  container: {
    padding: "50px 20px",
    minHeight: "100vh",
    textAlign: "right",
    direction: "rtl", // For RTL text direction
    backgroundColor: "#f9f9f9",
  },
  title: {
    color: "#880a0a",
    fontWeight: "bold",
    marginBottom: "40px",
    fontSize: "30px",
    textAlign: "center",
  },
  title2: {
    color: "#000",
    fontWeight: "bold",
    marginBottom: "20px",
    fontSize: "20px",
    textAlign: "center",
  },
  rulesList: {
    listStyleType: "none",
    padding: 0,
  },
  ruleItem: {
    backgroundColor: "#fff",
    border: "1px solid #880a0a",
    borderRadius: "8px",
    padding: "20px",
    marginBottom: "15px",
    color: "#333",
    lineHeight: "1.8",
    boxShadow: "0 4px 6px rgba(0, 0, 0, 0.1)",
    transition: "box-shadow 0.3s ease",
  },
  ruleTitle: {
    fontWeight: "bold",
    fontSize: "18px",
    color: "#880a0a",
    marginBottom: "10px",
  },
};



export async function getServerSideProps(context) {

  let header = {} 
  
  
  const headerPath = 'D:/Aida/projects/krabo-frontend/header.json';  
  
  
  
  try {

    const data = fs.readFileSync(headerPath, 'utf-8');
    header = {
          status : 200 ,
          success : true , 
          data : JSON.parse(data)
      }

  } catch (error) {
    header = {
      status : 500 , 
      message : "not found" , 
      success : false
    }

    
}


return {
  props: {
    header: header,
  },
};

 
}