// pages/faq.js  
import { useState } from 'react';  
import Navbar from "@components/Navbars/AppNav/kraboHeader"; // Adjust the import based on your project structure  
import MainLayout from "@layouts/Main";  
import FooterMobile from '@components/Navbars/AppNav/FooterMobile';
import photo1 from "../../../public/assets/img/photo1001.jpg" 
import photo2 from "../../../public/assets/img/photo1002.jpg" 
import fs from 'fs';


const questionsAndAnswers = [ 
  {
    title: "حساب کاربری",
    questions: [
      {  
        question: 'سوال ۱: آیا برای خرید از سایت گالری کرابو حتما باید عضو باشم؟',  
        answer: 'بله ، اگر بدون وارد شدن در سایت ، کالای مورد نظرتو به سبد خرید اضافه کرده باشی ، باید در مرحله نهایی کردن خرید با وارد کردن نام کاربری و رمز عبور وارد سایت بشی. اگر قبلا حساب کاربری نداشتی هم می تونی براحتی با وارد کردن ایمیل و مشخصات خود ، عضو سایت بشی.',  
      },  
      {  
        question: 'سوال ۲: آیاامکان ویرایش مشخصات کاربری و شماره تماس و ایمیل وجود داره؟',  
        answer: 'بله، میتونی در هر زمان مشخصات کاربری خودتو ویرایش کنی ، برای این کار کافیه  پس از وارد کردن ایمیل و رمز عبور وارد حساب کاربریت بشی و در قسمت اطلاعات کاربری ، اطلاعاتتو ویرایش کنی..',  
      },  
      {  
        question: 'سوال ۳: زمان تحویل سفارش چه مدت است؟',  
        answer: 'زمان تحویل معمولاً بین ۳ تا ۷ روز کاری است.',  
      },  
      {  
        question: 'سوال ۴: برای بازیابی رمز عبور چیکار کنم؟',  
        answer: 'میتونی از قابلیت رمز یکبار مصرف برای ورود به حساب کاربریت استفاده کنی و بعدش رمزتو عوض کنی.',  
      },  
      {  
        question: 'سوال ۵: آیا امکان دسترسی به اطلاعات خرید قبل برام وجود داره؟',  
        answer: 'برای دسترسی به اطلاعات خرید ها ی قبلی، باید با حساب کاربری خود وارد بشی، بعدش روی گزینه سفارش ها کلیک کن تا سوابق خریدات بهت نشون داده بشه.',  
      },  
    ]
  },
  {
    title: "ثبت و پیگیری سفارشات",
    questions: [
      {  
        question: 'بعد از ثبت سفارش چطور میتونم از وضعیتش مطلع بشم؟',  
        answer: 'برای اطلاع از وضعیت سفارشت ، می تونی وارد حساب کاربریت بشی و با کلیک روی گزینه سفارش ها از وضعیت اون با خبر بشی.',  
      },  
      {  
        question: 'بعد از ثبت سفارش برای اطمینان از پردازش باید با گالری کرابو در تماس باشم؟',  
        answer: "نه، بعد از انجام مراحل خرید و ثبت سفارش، پردازش سفارشت به صورت خودکار از طریق سرویس پیامک یا ایمیل اطلاع رسانی میشه و در صورتی که نیاز باشه کارشناسان فروش گالری کرابو با شما تماس میگیرن و همچنین با ورود به بخش حساب کاربریت میتونی از سفارشا ت با خبر بشی."  
      },  
      {  
        question: 'آیا میتونم سفارشم رو لغو کنم با تغییراتی در اون ایجاد کنم؟',  
        answer: 'تا قبل از تایید نهایی سفارش و کلیک روی آیکون اتمام خرید میتونی سفارش رو از سبد خریدت حذف و یا اصلاح کنی. پس از تایید نهایی و اتمام خرید و در مرحله پرداخت و ثبت، سبد خریدت امکان حذف یا تغییر سفارش رو نداره. از این مرحله به بعد برای لغو و تغییر آن با بخش پشتیبانی تماس بگیرید.',  
      },  
      {  
        question: 'از چه راه های دیگه ای میتونم سفارشم رو ثبت کنم؟',  
        answer: 'برای راحتی شما عزیزان ، گالری کرابو این امکان رو فراهم کرده تا علاوه بر سفارش از طریق سایت ، بتونید از طریق تماس با واحد ثبت سفارشات، پیج اینستاگرام ، شماره واتس اپ هم محصول مورد نظرتون رو تهیه کنید.',  
      },  
      {  
        question: 'ساعت پاسخگویی گالری کرابو چگونست؟',  
        answer: 'میتونی جهت سوال پرسیدن و یا موارد دیگه در ساعات اداری 10 الی 19 با شماره 09031787789 تماس بگیری.',  
      },
      {  
        question: 'آیا ثبت سفارش از یک محصول در گالری کرابو محدودیتی داره؟',  
        answer: 'نه ، در صورتی که هر محصولی موجودی داشته باشه ، هیچ محدودتی در تعداد سفارش محصول وجود نداره.',  
      },    
    ]
  },
  {
    title: "پرداخت",
    questions: [
        {  
            question: 'آیا قیمت محصولات در سایت گالری کرابو بروز هستند؟',  
            answer: 'بله، گالری کرابو به طور منظم و روزانه قیمت محصولات عرضه شده در سایت رو کنترل و به روز رسانی می کنه.',  
          },  
        {  
            question: 'چگونه میتونم هزینه سفارشم رو پرداخت کنم؟',  
            answer: 'در حال حاضر کاربران سایت فقط میتونن از طریق درگاه اینترنتی و با استفاده از تمامی کارت های بانکی عضو شتاب ، هزینه سفارش رو بصورت آنلاین پرداخت کنن.',  
          },  
        {  
            question: 'آیا پرداخت اینترنتی در سایت گالری کرابو امنه؟',  
            answer: 'پرداخت اینترنتی به گونه ای طراحی شده که امن و راحت باشه. با وجود این شما برای خرید از گالری کرابو هنگام هرگونه پرداخت اینترنتی برای اطمینان از امنیت پرداخت خود تکنیک های زیر رو لطفا رعایت کن: 1) با مشاهده قسمت آدرس ، در مرورگر وب خود مطمئن شو از پروتکل امن اچ تی تی پی اس بجای پروتکل اچ تی تی پی استفاده میشه.2) برای ورود اطلاعات کارت خود حتماً از صفحه کلید مجازی موجود استفاده کن.',  
          },  
        {  
            question: 'ممکن پرداخت اینترنتی ناموفق باشه ولی مبلغ از حساب من کم شده باشه؟',  
            answer: 'گاهی ممکنه در هنگام پرداخت شبکه بانکی قطع بشه که در این حالت معمولا پول شما در حساب های میان بانکیه.در این صورت بانک مغایرت ها را رفع میکنه و مبلغ رو بصورت خودکار به حساب شما برمیگردونه اما اگر تا 72 ساعت پول به حسابت برگشت نخورد ، اون موقع با بانک عامل پرداخت اینترنتی تماس بگیر.',  
          },  
         
    ]
  },
  {
    title: "ارسال سفارشات",
    questions: [
        {  
            question: 'پس از ثبت سفارش،حدودا چقد طول میکشه تا بدستم برسه؟',  
            answer: 'زمان ارسال سفارشات در تهران با توجه به زمانی که انتخاب میکنی متفاوته اما ارسال به خارج از تهران با پست،بعد از تحویل به ادراره پست از حدود 2 الی 4 روز کاری زمان میبره.',  
          },  
        {  
            question: 'سفارشم رو به چ روش هایی میتونم تحویل بگیریم؟',  
            answer: 'ارسال سفارشات تهران با پیک و پست امکان پذیره.همچین ارسال سفارشات به شهرهای دیگر با پست جمهوری اسلامی ایران انجام میشه.',  
          },  
        {  
            question: 'آیا میتونم سفارشم رو در روز و ساعت معینی تحویل بگیریم؟',  
            answer: 'بله فقط مشتریان تهران میتونم با تعیین بازه ارسال، سفارششون رو در زمانی که تعیین کردن تحویل بگیرن.',  
          },  
        {  
            question: 'هزینه ارسال سفارش چطور محاسبه میشه؟',  
            answer: 'هزینه ارسال سفارشات با پیک در تهران بستگی به مسافت توسط شرکت های حمل و نقل تعیین میشه و در ساعات مختلف روز متفاوته.هزینه ارسال با پست به سراسر ایران با هزینه 60 هزار تومان انجام میشه.',  
          },  
        {  
            question: 'آیا بسته بندی متفاوتی جهت هدیه دادن دارید؟',  
            answer: 'با توجه به اینکه طرح بسته بندی گالری کرابو دارای جعبه و بسته بندی شکیلیه در حال حاضر بجز بسته بندیه گالری بسته بندی دیگه ای ارائه نمیشه و تنها یک کارت تبریک با متن دلخواهت به بسته بندی اضافه میشه.',  
          },  
        {  
            question: 'آیا میتونم برای شخص دیگه ای از گالری کرابو خرید کنم و سفارش تحویل اون شخص بشه؟',  
            answer: 'بله، بعد از انتخاب محصول های مورد نظر و اضافه کردن اونا به سبد خرید، در مرحله ارسال اطلاعات ، میتونی آدرس و مشخصات تحویل گیرنده رو وارد کنی.',  
          },  
          {  
            question: 'سفارشات چ زمانی به پست تحویل داده میشن؟',  
            answer: 'همه سفارشات پس از طی مراحل پردازش، در روز بعد از انجام مراحل پردازش ، تحویل ادراه پست میشه.',  
          },  
          
          {  
            question: 'میتونم محصولی رو که از سایت سفارش دادم بصورت حضوری تحویل بگیریم؟',  
            answer: 'از اونجایی که یکی از اهداف فروشگاه اینترنتی گالری کرابو کاهش سفرهای درون شهری غیر ضروریه، تحویل حضوری سفارش ها در محل دفتر گالری کرابو امکان پذیر نیست.',  
          },  
          {  
            question: 'از چ طریق سفارش پستیم رو پیگیری کنم؟',  
            answer: 'هر یک از سفارشات تحول داده شده به پست دارای کد مرجع 24 رقمیه که با استفاده از اون در صفحه شخصی و یا در بخش رهگیری سایت پست به آدرس www.newtracking.post.ir میتونی از آخرین موقعیت سفارشت مطلع بشی',  
          },  
          {  
            question: 'تحویل با پیک در تهران شامل چ مناطقی میشود؟',  
            answer: 'شامل تمامی مناطق 22 گانه تهران.',  
          },  
          {  
            question: 'پست شهرستان چ شهر هایی رو شامل میشود؟',  
            answer: 'کلیه شهرها تحت پوشش پست جمهوری اسلامی ایرانه.',  
          },  
          {  
            question: 'آیا امکان ارسال سفارشات تهران با پست هم هست؟',  
            answer: 'بله،در صورت خواسته مشتری امکان ارسال تهران با پست هم وجود داره.',  
          },  
          {  
            question: 'در صورتی که خرید من برای شخص دیگه ای باشه،آیا فاکتور فروش همراه بسته برای تحویل گیرنده ارسال میشه؟',  
            answer: 'در صورت درخواست شما ، فاکتور فروش بهمراه محصول ارسال نمیشه.میتونید از واحد پشتیبانی نسخه الکترونیکی فاکتور رو درخواست کنید.',  
          },  
          {  
            question: 'آیا میتونم زمان تحویل رو خودم مشخص کنم؟',  
            answer: 'بله ، برای مشتریان تهران این امکان وجود داره. (توجه داشته باشید که زمان درخواستی باید بیش از 2 ساعت پس از ثبت سفارش باشد)',  
          },  
    ]

  },
  {
    title: "گارانتی و خدمات پس از فروش و راهنمای سایز",
    questions: [
        {  
            question: 'اگر محصولی که خریدم ایراد فنی یا آسیب دیدگی داشته باشه،باید چیکار کنم؟',  
            answer: 'لطفا برای هماهنگی های لازم ، با تیم پشتیبانی تماس بگیر.',  
          },  
          {  
            question: 'شرایط زمانی عودت‌ کالا به چه صورته؟',  
            answer: 'عودت کالا فقط شامل محصولات موجوده و محصولاتی که سفارشی ساخت هستن شامل این شرایط نمیشن.امکان عودت محصول  تا 3 روز کاری پس از تحویل سفارش وجود داره.',  
          },  
          {  
            question: 'در صورت بازگردوندن محصول،مبلغ پرداخت شده ی من چ زمانی و چگونه برگشت داشته میشود؟',  
            answer: 'هنگامی که محصولی عودت داده بشه، پس از کارشناسی و تایید واحد خدمات پس از فروش ، هماهنگی لازم برای استرداد مبلغ سفارش با مشتری به عمل میاد و نهایتا تا 48 ساعت کاری مبلغ به حساب مشتری بازگردانده خواهد شد.',  
          },  
          {  
            question: 'چطور از سایز محصول سفارشیه خودم مطمئن باشم؟',  
            answer: 'برای داشتن انتخابی دقیق و مطمئن ، گالری کرابو راهنمای سایزبندی و نحوه اندازه گرفتن تمامی محصولات رو برای شما قرار داده..',  
          },  
          
    ]
    
  }
];  

export default function Faq({header}) {  
  const [activeIndex, setActiveIndex] = useState(null);  
  const [activeCategory, setActiveCategory] = useState(null); // State for the active category

  const toggleAnswer = (index) => {  
    setActiveIndex(activeIndex === index ? null : index);  
  };

  const toggleCategory = (categoryIndex) => {
    setActiveCategory(activeCategory === categoryIndex ? null : categoryIndex);
  };

  return (  
    <>  
      <MainLayout isRTL>  
      <Navbar header={header?.data?.data}
              location={"home"}
              rtl/>
        <div style={{width:"100%",direction:"ltr",display:"flex",justifyContent:"space-evenly"}}><img alt='گردنبند1' style={{width:"30%",borderRadius:10}} src={photo2.src}/><img alt='گردنبند2' style={{width:"30%",borderRadius:10}} src={photo1.src}/></div>
        <div style={styles.container}>  
          <h1 style={styles.title}>سوالات رایج</h1>  
          <div className="accordion">  
            {questionsAndAnswers.map((qa, categoryIndex) => (  
              <div key={categoryIndex}>  
                <h2
                  style={styles.categoryTitle}
                  onClick={() => toggleCategory(categoryIndex)} // Toggle category collapse
                >
                  {qa.title}
                </h2>  
                
                {activeCategory === categoryIndex && (
                  qa.questions.map((questionItem, index) => (  
                    <div key={index} style={styles.questionCard}>  
                      <div  
                        style={styles.cardHeader}  
                        onClick={() => toggleAnswer(`${categoryIndex}-${index}`)}  
                      >  
                        {questionItem.question}  
                      </div>  
                    {  activeIndex === `${categoryIndex}-${index}` && <div style={{  
                        ...styles.answer,  
                        maxHeight: activeIndex === `${categoryIndex}-${index}` ? '200px' : '0',  
                        opacity: activeIndex === `${categoryIndex}-${index}` ? 1 : 0  
                      }}>  
                        {questionItem.answer}  
                      </div> } 
                    </div>  
                  ))
                )}
              </div>  
            ))}  
          </div>  
        </div>  
      </MainLayout>  
      <div style={{height:100}}></div>
      <FooterMobile location="home" header={header?.data?.data}/>
    </>  
  );  
}  

const styles = {  
  container: {  
    padding: '50px 20px',  
    minHeight: '100vh',  
    textAlign: 'center'  
  },  
  title: {  
    backgroundColor: '#880a0a',
    color:"#fff",  
    fontWeight: 'bold',  
    marginBottom: '40px' ,
    borderRadius:10
  },  
  categoryTitle: {  
    color: '#880a0a',  
    border:"1px solid #880a0a",
    fontWeight: 'bold',  
    fontSize: '24px',  
    marginTop: '20px',  
    marginBottom: '20px',  
    borderRadius:10,
    cursor: 'pointer'  ,
    backgroundColor: '#880a0a11', // Light crimson background  

  },  
  questionCard: {  
    margin: '10px 0',  
    border: '1px solid #880a0a',  
    borderRadius: '8px',  
    transition: 'box-shadow 0.3s ease',  
    overflow: 'hidden'  
  },  
  cardHeader: {  
    cursor: 'pointer',  
    color: '#880a0a',  
    fontWeight: 'bold',  
    backgroundColor: '#fff',  
    padding: '15px',  
    borderBottom: '1px solid #880a0a'  ,
    fontSize:16,
  },  
  answer: {  
    fontSize:14,
    overflow: 'hidden',  
    transition: 'max-height 0.3s ease, opacity 0.3s ease',  
    padding: '15px'  
  }  
};
export async function getServerSideProps(context) {

  let header = {} 
  
  
  const headerPath = 'D:/Aida/projects/krabo-frontend/header.json';  
  
  
  
  try {

    const data = fs.readFileSync(headerPath, 'utf-8');
    header = {
          status : 200 ,
          success : true , 
          data : JSON.parse(data)
      }

  } catch (error) {
    header = {
      status : 500 , 
      message : "not found" , 
      success : false
    }

    
}


return {
  props: {
    header: header,
  },
};

 
}